# Задание A2
import string

parol = input()

# Флажки: 1 - есть, 0 - нет
A = 0  # заглавные
a = 0  # строчные
c = 0  # цифры
s = 0  # спецсимволы

# Проверяем длину
if len(parol) != 8:
    print("Длина пароля не равна 8")

# Идем по каждому символу
for i in parol:
    if i in string.ascii_uppercase:
        A = 1
    elif i in string.ascii_lowercase:
        a = 1
    elif i in string.digits:
        c = 1
    elif i == '*' or i == '-' or i == '#':
        s = 1
    else:
        print("В пароле используются непредусмотренные символы")
        A = -1  # Чтобы в конце не вывелся "Надежный пароль"
        break  # Выходим из цикла, чтобы не дублировать ошибку

# Выводим ошибки, если флажки равны 0
if A == 0:
    print("В пароле отсутствуют заглавные буквы")
if a == 0:
    print("В пароле отсутствуют строчные буквы")
if c == 0:
    print("В пароле отсутствуют цифры")
if s == 0:
    print("В пароле отсутствуют специальные символы")

# Если все флажки 1 (и нет плохих символов)
if A == 1 and a == 1 and c == 1 and s == 1:
    print("Надежный пароль")