# Ввод показаний
p = int(input())
t = int(input())

# Считаем расход
if t < p:
    # Если счетчик перешел через 9999
    r = (10000 - p) + t
else:
    r = t - p

# Считаем оплату
if r <= 300:
    summa = 21
elif r <= 600:
    summa = 21 + (r - 300) * 0.06
elif r <= 800:
    summa = 21 + 300 * 0.06 + (r - 600) * 0.04
else:
    summa = 21 + 300 * 0.06 + 200 * 0.04 + (r - 800) * 0.025

# Средняя цена
sred = summa / r

# Вывод (через пробелы, как в примере)
print("Предыдущее  Текущее  Использовано  К оплате  Ср. цена m^3")
print(p, "         ", t, "      ", r, "            ", round(summa, 2), "     ", round(sred, 2))